## Final Project Submission

Please fill out:
* Student name: 
* Student pace: self paced / part time / full time
* Scheduled project review date/time: 
* Instructor name: 
* Blog post URL:

In [ ]:
# Your code here - remember to use markdown cells for comments as well!

In [1]:
import os, glob

In [2]:
os.listdir()

['.git',
 '.gitignore',
 '.ipynb_checkpoints',
 '.learn',
 'awesome.gif',
 'CONTRIBUTING.md',
 'LICENSE.md',
 'module1_project_rubric.pdf',
 'README.md',
 'student.ipynb',
 'zippedData']

In [3]:
os.listdir('zippedData/')

['bom.movie_gross.csv.gz',
 'imdb.name.basics.csv.gz',
 'imdb.title.akas.csv.gz',
 'imdb.title.basics.csv.gz',
 'imdb.title.crew.csv.gz',
 'imdb.title.principals.csv.gz',
 'imdb.title.ratings.csv.gz',
 'rt.movie_info.tsv.gz',
 'rt.reviews.tsv.gz',
 'tmdb.movies.csv.gz',
 'tn.movie_budgets.csv.gz']

In [4]:
glob.glob('zippedData/')

['zippedData/']

In [8]:
files = glob.glob('zippedData/*')
files

['zippedData\\bom.movie_gross.csv.gz',
 'zippedData\\imdb.name.basics.csv.gz',
 'zippedData\\imdb.title.akas.csv.gz',
 'zippedData\\imdb.title.basics.csv.gz',
 'zippedData\\imdb.title.crew.csv.gz',
 'zippedData\\imdb.title.principals.csv.gz',
 'zippedData\\imdb.title.ratings.csv.gz',
 'zippedData\\rt.movie_info.tsv.gz',
 'zippedData\\rt.reviews.tsv.gz',
 'zippedData\\tmdb.movies.csv.gz',
 'zippedData\\tn.movie_budgets.csv.gz']

In [6]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import matplotlib as mpl

In [16]:
files[0].split('\\')[-1]

'bom.movie_gross.csv.gz'

In [30]:
pd.read_csv(files[6], encoding = 'Latin-1')

           tconst  averagerating  numvotes
0      tt10356526            8.3        31
1      tt10384606            8.9       559
2       tt1042974            6.4        20
3       tt1043726            4.2     50352
4       tt1060240            6.5        21
...           ...            ...       ...
73851   tt9805820            8.1        25
73852   tt9844256            7.5        24
73853   tt9851050            4.7        14
73854   tt9886934            7.0         5
73855   tt9894098            6.3       128

[73856 rows x 3 columns]

In [47]:
data_tables = {}
for file in files:
    key = file.split('\\')[-1]
    try:
        df= pd.read_csv(file, encoding = 'Latin-1')
    except:
        df= pd.read_csv(file, sep='\t',encoding='Latin-1')
    data_tables[key] = df

len(data_tables)

11

In [58]:
for key,value in data_tables.items():
    print(key)
    display(value)
    print('\n')

bom.movie_gross.csv.gz

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010
...,...,...,...,...,...
3382,The Quake,Magn.,6200.0,NaN,2018
3383,Edward II (2018 re-release),FM,4800.0,NaN,2018
3384,El Pacto,Sony,2500.0,NaN,2018
3385,The Swan,Synergetic,2400.0,NaN,2018
3386,An Actor Prepares,Grav.,1700.0,NaN,2018

imdb.name.basics.csv.gz

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"
...,...,...,...,...,...,...
606643,nm9990381,Susan Grobes,NaN,NaN,actress,NaN
606644,nm9990690,Joo Yeon So,NaN,NaN,actress,"tt9090932,tt8737130"
606645,nm9991320,Madeline Smith,NaN,NaN,actress,"tt8734436,tt9615610"
606646,nm9991786,Michelle Modigliani,NaN,NaN,producer,NaN
606647,nm9993380,Pegasus EnvoyÃ©,NaN,NaN,"director,actor,writer",tt8743182

imdb.title.akas.csv.gz

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,ÐÐ¶ÑÑÐ°ÑÐ¸Ðº ÑÐ²ÑÑ,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,NaN,imdbDisplay,NaN,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,NaN,NaN,short title,0.0
4,tt0369610,14,Jurassic World,FR,NaN,imdbDisplay,NaN,0.0
...,...,...,...,...,...,...,...,...
331698,tt9827784,2,Sayonara kuchibiru,NaN,NaN,original,NaN,1.0
331699,tt9827784,3,Farewell Song,XWW,en,imdbDisplay,NaN,0.0
331700,tt9880178,1,La atenciÃ³n,NaN,NaN,original,NaN,1.0
331701,tt9880178,2,La atenciÃ³n,ES,NaN,NaN,NaN,0.0
331702,tt9880178,3,The Attention,XWW,en,imdbDisplay,NaN,0.0

imdb.title.basics.csv.gz

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
...,...,...,...,...,...,...
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,tt9916622,Rodolpho TeÃ³philo - O Legado de um Pioneiro,Rodolpho TeÃ³philo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,NaN
146143,tt9916754,Chico Albuquerque - RevelaÃ§Ãµes,Chico Albuquerque - RevelaÃ§Ãµes,2013,NaN,Documentary

imdb.title.crew.csv.gz

           tconst                      directors              writers
0       tt0285252                      nm0899854            nm0899854
1       tt0438973                            NaN  nm0175726,nm1802864
2       tt0462036                      nm1940585            nm1940585
3       tt0835418                      nm0151540  nm0310087,nm0841532
4       tt0878654  nm0089502,nm2291498,nm2292011            nm0284943
...           ...                            ...                  ...
146139  tt8999974                     nm10122357           nm10122357
146140  tt9001390                      nm6711477            nm6711477
146141  tt9001494          nm10123242,nm10123248                  NaN
146142  tt9004986                      nm4993825            nm4993825
146143  tt9010172                            NaN            nm8352242

[146144 rows x 3 columns]

imdb.title.principals.csv.gz

,tconst,ordering,nconst,category,job,characters
0,tt0111414,1,nm0246005,actor,NaN,"[""The Man""]"
1,tt0111414,2,nm0398271,director,NaN,NaN
2,tt0111414,3,nm3739909,producer,producer,NaN
3,tt0323808,10,nm0059247,editor,NaN,NaN
4,tt0323808,1,nm3579312,actress,NaN,"[""Beth Boothby""]"
...,...,...,...,...,...,...
1028181,tt9692684,1,nm0186469,actor,NaN,"[""Ebenezer Scrooge""]"
1028182,tt9692684,2,nm4929530,self,NaN,"[""Herself"",""Regan""]"
1028183,tt9692684,3,nm10441594,director,NaN,NaN
1028184,tt9692684,4,nm6009913,writer,writer,NaN
1028185,tt9692684,5,nm10441595,producer,producer,NaN

imdb.title.ratings.csv.gz

           tconst  averagerating  numvotes
0      tt10356526            8.3        31
1      tt10384606            8.9       559
2       tt1042974            6.4        20
3       tt1043726            4.2     50352
4       tt1060240            6.5        21
...           ...            ...       ...
73851   tt9805820            8.1        25
73852   tt9844256            7.5        24
73853   tt9851050            4.7        14
73854   tt9886934            7.0         5
73855   tt9894098            6.3       128

[73856 rows x 3 columns]

rt.movie_info.tsv.gz

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One
2,5,Illeana Douglas delivers a superb performance ...,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,NaN,116 minutes,NaN
3,6,Michael Douglas runs afoul of a treacherous su...,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,NaN,128 minutes,NaN
4,7,NaN,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,NaN,200 minutes,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
1555,1996,Forget terrorists or hijackers -- there's a ha...,R,Action and Adventure|Horror|Mystery and Suspense,NaN,NaN,"Aug 18, 2006","Jan 2, 2007",$,"33,886,034",106 minutes,New Line Cinema
1556,1997,The popular Saturday Night Live sketch was exp...,PG,Comedy|Science Fiction and Fantasy,Steve Barron,Terry Turner|Tom Davis|Dan Aykroyd|Bonnie Turner,"Jul 23, 1993","Apr 17, 2001",NaN,NaN,88 minutes,Paramount Vantage
1557,1998,"Based on a novel by Richard Powell, when the l...",G,Classics|Comedy|Drama|Musical and Performing Arts,Gordon Douglas,NaN,"Jan 1, 1962","May 11, 2004",NaN,NaN,111 minutes,NaN
1558,1999,The Sandlot is a coming-of-age story about a g...,PG,Comedy|Drama|Kids and Family|Sports and Fitness,David Mickey Evans,David Mickey Evans|Robert Gunter,"Apr 1, 1993","Jan 29, 2002",NaN,NaN,101 minutes,NaN
1559,2000,"Suspended from the force, Paris cop Hubert is ...",R,Action and Adventure|Art House and Internation...,NaN,Luc Besson,"Sep 27, 2001","Feb 11, 2003",NaN,NaN,94 minutes,Columbia Pictures

rt.reviews.tsv.gz

,id,review,rating,fresh,critic,top_critic,publisher,date
0,3,A distinctly gallows take on contemporary fina...,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
1,3,It's an allegory in search of a meaning that n...,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018"
2,3,... life lived in a bubble in financial dealin...,NaN,fresh,Sean Axmaker,0,Stream on Demand,"January 4, 2018"
3,3,Continuing along a line introduced in last yea...,NaN,fresh,Daniel Kasman,0,MUBI,"November 16, 2017"
4,3,... a perverse twist on neorealism...,NaN,fresh,NaN,0,Cinema Scope,"October 12, 2017"
...,...,...,...,...,...,...,...,...
54427,2000,The real charm of this trifle is the deadpan c...,NaN,fresh,Laura Sinagra,1,Village Voice,"September 24, 2002"
54428,2000,NaN,1/5,rotten,Michael Szymanski,0,Zap2it.com,"September 21, 2005"
54429,2000,NaN,2/5,rotten,Emanuel Levy,0,EmanuelLevy.Com,"July 17, 2005"
54430,2000,NaN,2.5/5,rotten,Christopher Null,0,Filmcritic.com,"September 7, 2003"
54431,2000,NaN,3/5,fresh,Nicolas Lacroix,0,Showbizz.net,"November 12, 2002"

tmdb.movies.csv.gz

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186
...,...,...,...,...,...,...,...,...,...,...
26512,26512,"[27, 18]",488143,en,Laboratory Conditions,0.600,2018-10-13,Laboratory Conditions,0.0,1
26513,26513,"[18, 53]",485975,en,_EXHIBIT_84xxx_,0.600,2018-05-01,_EXHIBIT_84xxx_,0.0,1
26514,26514,"[14, 28, 12]",381231,en,The Last One,0.600,2018-10-01,The Last One,0.0,1
26515,26515,"[10751, 12, 28]",366854,en,Trailer Made,0.600,2018-06-22,Trailer Made,0.0,1
26516,26516,"[53, 27]",309885,en,The Church,0.600,2018-10-05,The Church,0.0,1

tn.movie_budgets.csv.gz

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
...,...,...,...,...,...,...
5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0
5778,79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495"
5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338"
5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"

In [61]:
class color:
   PURPLE = '\033[95m'
   CYAN = '\033[96m'
   DARKCYAN = '\033[36m'
   BLUE = '\033[94m'
   GREEN = '\033[92m'
   YELLOW = '\033[93m'
   RED = '\033[91m'
   BOLD = '\033[1m'
   UNDERLINE = '\033[4m'
   END = '\033[0m'
for key,value in data_tables.items():
    print(color.UNDERLINE + key + color.END)
    print(value.columns)
    print('\n')

bom.movie_gross.csv.gz
Index(['title', 'studio', 'domestic_gross', 'foreign_gross', 'year'], dtype='object')


imdb.name.basics.csv.gz
Index(['nconst', 'primary_name', 'birth_year', 'death_year',
       'primary_profession', 'known_for_titles'],
      dtype='object')


imdb.title.akas.csv.gz
Index(['title_id', 'ordering', 'title', 'region', 'language', 'types',
       'attributes', 'is_original_title'],
      dtype='object')


imdb.title.basics.csv.gz
Index(['tconst', 'primary_title', 'original_title', 'start_year',
       'runtime_minutes', 'genres'],
      dtype='object')


imdb.title.crew.csv.gz
Index(['tconst', 'directors', 'writers'], dtype='object')


imdb.title.principals.csv.gz
Index(['tconst', 'ordering', 'nconst', 'category', 'job', 'characters'], dtype='object')


imdb.title.ratings.csv.gz
Index(['tconst', 'averagerating', 'numvotes'], dtype='object')


rt.movie_info.tsv.gz
Index(['id', 'synopsis', 'rating', 'genre', 'director', 'writer',
       'theater_date', 'dvd_date', 'currency', 'box_office', 'runtime',
       'studio'],
      dtype='object')


rt.reviews.tsv.gz
Index(['id', 'review', 'rating', 'fresh', 'critic', 'top_critic', 'publisher',
       'date'],
      dtype='object')


tmdb.movies.csv.gz
Index(['Unnamed: 0', 'genre_ids', 'id', 'original_language', 'original_title',
       'popularity', 'release_date', 'title', 'vote_average', 'vote_count'],
      dtype='object')


tn.movie_budgets.csv.gz
Index(['id', 'release_date', 'movie', 'production_budget', 'domestic_gross',
       'worldwide_gross'],
      dtype='object')

In [77]:
data_tables['bom.movie_gross.csv.gz'].columns[(data_tables['bom.movie_gross.csv.gz'].columns).isin(data_tables['imdb.title.akas.csv.gz'].columns)]

Index(['title'], dtype='object')

In [ ]:
df_columns =

In [81]:
def common_columns (df_columns, df_columns):
    for df_column in df_columns:
        if df_column != df_column_1:
            return(df_column_1[df_column_1.isin(df_column)])

SyntaxError: duplicate argument 'df_columns' in function definition (<ipython-input-81-d6c7c7f58a8c>, line 4)

In [85]:
def common_columns (df_1, df_dict):
    for key, df in df_dict.items():
#         if df != df_1:
            return df_1.columns[(df_1.columns).isin(df.columns)]

In [86]:
common_columns(data_tables['bom.movie_gross.csv.gz'], data_tables)

Index(['title', 'studio', 'domestic_gross', 'foreign_gross', 'year'], dtype='object')

In [87]:
def common_columns (df_1, df_dict):
    common_columns = {}
    for key, df in df_dict.items():
        common_columns[key]= df_1.columns[(df_1.columns).isin(df.columns)]
    return common_columns

In [88]:
common_columns(data_tables['bom.movie_gross.csv.gz'], data_tables)

{'bom.movie_gross.csv.gz': Index(['title', 'studio', 'domestic_gross', 'foreign_gross', 'year'], dtype='object'),
 'imdb.name.basics.csv.gz': Index([], dtype='object'),
 'imdb.title.akas.csv.gz': Index(['title'], dtype='object'),
 'imdb.title.basics.csv.gz': Index([], dtype='object'),
 'imdb.title.crew.csv.gz': Index([], dtype='object'),
 'imdb.title.principals.csv.gz': Index([], dtype='object'),
 'imdb.title.ratings.csv.gz': Index([], dtype='object'),
 'rt.movie_info.tsv.gz': Index(['studio'], dtype='object'),
 'rt.reviews.tsv.gz': Index([], dtype='object'),
 'tmdb.movies.csv.gz': Index(['title'], dtype='object'),
 'tn.movie_budgets.csv.gz': Index(['domestic_gross'], dtype='object')}

In [97]:
def common_columns (df_1, df_dict):
    common_columns = {}
    for key, df in df_dict.items():
        print(color.UNDERLINE + key + color.END)
        print(df_1.columns[(df_1.columns).isin(df.columns)])
        print('')

In [98]:
common_columns(data_tables['bom.movie_gross.csv.gz'], data_tables)

bom.movie_gross.csv.gz
Index(['title', 'studio', 'domestic_gross', 'foreign_gross', 'year'], dtype='object')

imdb.name.basics.csv.gz
Index([], dtype='object')

imdb.title.akas.csv.gz
Index(['title'], dtype='object')

imdb.title.basics.csv.gz
Index([], dtype='object')

imdb.title.crew.csv.gz
Index([], dtype='object')

imdb.title.principals.csv.gz
Index([], dtype='object')

imdb.title.ratings.csv.gz
Index([], dtype='object')

rt.movie_info.tsv.gz
Index(['studio'], dtype='object')

rt.reviews.tsv.gz
Index([], dtype='object')

tmdb.movies.csv.gz
Index(['title'], dtype='object')

tn.movie_budgets.csv.gz
Index(['domestic_gross'], dtype='object')

In [101]:
def common_columns (df_1, df_dict):
    common_columns = {}
    for key, df in df_dict.items():
        if ((df_1.columns).isin(df.columns)).any():
            print(color.UNDERLINE + key + color.END)
            print(df_1.columns[(df_1.columns).isin(df.columns)])
            print('')

In [102]:
common_columns(data_tables['bom.movie_gross.csv.gz'], data_tables)

bom.movie_gross.csv.gz
Index(['title', 'studio', 'domestic_gross', 'foreign_gross', 'year'], dtype='object')

imdb.title.akas.csv.gz
Index(['title'], dtype='object')

rt.movie_info.tsv.gz
Index(['studio'], dtype='object')

tmdb.movies.csv.gz
Index(['title'], dtype='object')

tn.movie_budgets.csv.gz
Index(['domestic_gross'], dtype='object')

In [103]:
def common_columns (df_1, df_dict):
    common_columns = {}
    for key, df in df_dict.items():
        if ((df_1.columns).isin(df.columns)).any():
            common_columns[key]= df_1.columns[(df_1.columns).isin(df.columns)]
    return common_columns

In [104]:
common_columns(data_tables['bom.movie_gross.csv.gz'], data_tables)

{'bom.movie_gross.csv.gz': Index(['title', 'studio', 'domestic_gross', 'foreign_gross', 'year'], dtype='object'),
 'imdb.title.akas.csv.gz': Index(['title'], dtype='object'),
 'rt.movie_info.tsv.gz': Index(['studio'], dtype='object'),
 'tmdb.movies.csv.gz': Index(['title'], dtype='object'),
 'tn.movie_budgets.csv.gz': Index(['domestic_gross'], dtype='object')}

In [111]:
def common_columns (df_1, df_dict):
    common_columns = {}
    for key, df in df_dict.items():
        if (((df_1.columns).isin(df.columns)).any()) and (df_1.columns.any() != df.columns.any()):
            common_columns[key]= df_1.columns[(df_1.columns).isin(df.columns)]
    return common_columns

In [112]:
common_columns(data_tables['bom.movie_gross.csv.gz'], data_tables)

{'imdb.title.akas.csv.gz': Index(['title'], dtype='object'),
 'rt.movie_info.tsv.gz': Index(['studio'], dtype='object'),
 'tmdb.movies.csv.gz': Index(['title'], dtype='object'),
 'tn.movie_budgets.csv.gz': Index(['domestic_gross'], dtype='object')}

In [117]:
for title, table in data_tables.items():
    if common_columns(table, data_tables):
        print(color.BOLD + title + color.END)
        print(common_columns(table, data_tables))
        print('')

bom.movie_gross.csv.gz
{'imdb.title.akas.csv.gz': Index(['title'], dtype='object'), 'rt.movie_info.tsv.gz': Index(['studio'], dtype='object'), 'tmdb.movies.csv.gz': Index(['title'], dtype='object'), 'tn.movie_budgets.csv.gz': Index(['domestic_gross'], dtype='object')}

imdb.name.basics.csv.gz
{'imdb.title.principals.csv.gz': Index(['nconst'], dtype='object')}

imdb.title.akas.csv.gz
{'bom.movie_gross.csv.gz': Index(['title'], dtype='object'), 'imdb.title.principals.csv.gz': Index(['ordering'], dtype='object'), 'tmdb.movies.csv.gz': Index(['title'], dtype='object')}

imdb.title.basics.csv.gz
{'tmdb.movies.csv.gz': Index(['original_title'], dtype='object')}

imdb.title.principals.csv.gz
{'imdb.name.basics.csv.gz': Index(['nconst'], dtype='object'), 'imdb.title.akas.csv.gz': Index(['ordering'], dtype='object')}

rt.movie_info.tsv.gz
{'bom.movie_gross.csv.gz': Index(['studio'], dtype='object'), 'tmdb.movies.csv.gz': Index(['id'], dtype='object')}

rt.reviews.tsv.gz
{'tmdb.movies.csv.gz': Index(['id'], dtype='object')}

tmdb.movies.csv.gz
{'bom.movie_gross.csv.gz': Index(['title'], dtype='object'), 'imdb.title.akas.csv.gz': Index(['title'], dtype='object'), 'imdb.title.basics.csv.gz': Index(['original_title'], dtype='object'), 'rt.movie_info.tsv.gz': Index(['id'], dtype='object'), 'rt.reviews.tsv.gz': Index(['id'], dtype='object'), 'tn.movie_budgets.csv.gz': Index(['id', 'release_date'], dtype='object')}

tn.movie_budgets.csv.gz
{'bom.movie_gross.csv.gz': Index(['domestic_gross'], dtype='object'), 'tmdb.movies.csv.gz': Index(['id', 'release_date'], dtype='object')}

In [124]:
common_columns_dict = {}
for title, table in data_tables.items():
    if common_columns(table, data_tables):
        common_columns_dict[title] = common_columns(table, data_tables)

common_columns_dict

{'bom.movie_gross.csv.gz': {'imdb.title.akas.csv.gz': Index(['title'], dtype='object'),
  'rt.movie_info.tsv.gz': Index(['studio'], dtype='object'),
  'tmdb.movies.csv.gz': Index(['title'], dtype='object'),
  'tn.movie_budgets.csv.gz': Index(['domestic_gross'], dtype='object')},
 'imdb.name.basics.csv.gz': {'imdb.title.principals.csv.gz': Index(['nconst'], dtype='object')},
 'imdb.title.akas.csv.gz': {'bom.movie_gross.csv.gz': Index(['title'], dtype='object'),
  'imdb.title.principals.csv.gz': Index(['ordering'], dtype='object'),
  'tmdb.movies.csv.gz': Index(['title'], dtype='object')},
 'imdb.title.basics.csv.gz': {'tmdb.movies.csv.gz': Index(['original_title'], dtype='object')},
 'imdb.title.principals.csv.gz': {'imdb.name.basics.csv.gz': Index(['nconst'], dtype='object'),
  'imdb.title.akas.csv.gz': Index(['ordering'], dtype='object')},
 'rt.movie_info.tsv.gz': {'bom.movie_gross.csv.gz': Index(['studio'], dtype='object'),
  'tmdb.movies.csv.gz': Index(['id'], dtype='object')},
 'rt.reviews.tsv.gz': {'tmdb.movies.csv.gz': Index(['id'], dtype='object')},
 'tmdb.movies.csv.gz': {'bom.movie_gross.csv.gz': Index(['title'], dtype='object'),
  'imdb.title.akas.csv.gz': Index(['title'], dtype='object'),
  'imdb.title.basics.csv.gz': Index(['original_title'], dtype='object'),
  'rt.movie_info.tsv.gz': Index(['id'], dtype='object'),
  'rt.reviews.tsv.gz': Index(['id'], dtype='object'),
  'tn.movie_budgets.csv.gz': Index(['id', 'release_date'], dtype='object')},
 'tn.movie_budgets.csv.gz': {'bom.movie_gross.csv.gz': Index(['domestic_gross'], dtype='object'),
  'tmdb.movies.csv.gz': Index(['id', 'release_date'], dtype='object')}}

## Individual Table Analysis ##

In [126]:
data_tables.keys()

dict_keys(['bom.movie_gross.csv.gz', 'imdb.name.basics.csv.gz', 'imdb.title.akas.csv.gz', 'imdb.title.basics.csv.gz', 'imdb.title.crew.csv.gz', 'imdb.title.principals.csv.gz', 'imdb.title.ratings.csv.gz', 'rt.movie_info.tsv.gz', 'rt.reviews.tsv.gz', 'tmdb.movies.csv.gz', 'tn.movie_budgets.csv.gz'])

#### bom.movie_gross.csv.gz ####

In [131]:
bom_movie_gross = data_tables['bom.movie_gross.csv.gz']
bom_movie_gross

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010
...,...,...,...,...,...
3382,The Quake,Magn.,6200.0,NaN,2018
3383,Edward II (2018 re-release),FM,4800.0,NaN,2018
3384,El Pacto,Sony,2500.0,NaN,2018
3385,The Swan,Synergetic,2400.0,NaN,2018
3386,An Actor Prepares,Grav.,1700.0,NaN,2018

In [132]:
display(bom_movie_gross.info())
bom_movie_gross.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

None

title                0
studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

#### imdb.name.basics.csv.gz ####

In [133]:
imdb_name_basics = data_tables['imdb.name.basics.csv.gz']
imdb_name_basics

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"
...,...,...,...,...,...,...
606643,nm9990381,Susan Grobes,NaN,NaN,actress,NaN
606644,nm9990690,Joo Yeon So,NaN,NaN,actress,"tt9090932,tt8737130"
606645,nm9991320,Madeline Smith,NaN,NaN,actress,"tt8734436,tt9615610"
606646,nm9991786,Michelle Modigliani,NaN,NaN,producer,NaN
606647,nm9993380,Pegasus EnvoyÃ©,NaN,NaN,"director,actor,writer",tt8743182

In [134]:
display(imdb_name_basics.info())
imdb_name_basics.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 606648 entries, 0 to 606647
Data columns (total 6 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   nconst              606648 non-null  object
 1   primary_name        606648 non-null  object
 2   birth_year          82736 non-null   float64
 3   death_year          6783 non-null    float64
 4   primary_profession  555308 non-null  object
 5   known_for_titles    576444 non-null  object
dtypes: float64(2), object(4)
memory usage: 27.8+ MB

None

nconst                     0
primary_name               0
birth_year            523912
death_year            599865
primary_profession     51340
known_for_titles       30204
dtype: int64

#### 'imdb.title.akas.csv.gz' ####

In [135]:
imdb_title_akas = data_tables['imdb.title.akas.csv.gz']
imdb_title_akas

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,ÐÐ¶ÑÑÐ°ÑÐ¸Ðº ÑÐ²ÑÑ,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,NaN,imdbDisplay,NaN,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,NaN,NaN,short title,0.0
4,tt0369610,14,Jurassic World,FR,NaN,imdbDisplay,NaN,0.0
...,...,...,...,...,...,...,...,...
331698,tt9827784,2,Sayonara kuchibiru,NaN,NaN,original,NaN,1.0
331699,tt9827784,3,Farewell Song,XWW,en,imdbDisplay,NaN,0.0
331700,tt9880178,1,La atenciÃ³n,NaN,NaN,original,NaN,1.0
331701,tt9880178,2,La atenciÃ³n,ES,NaN,NaN,NaN,0.0
331702,tt9880178,3,The Attention,XWW,en,imdbDisplay,NaN,0.0

In [136]:
display(imdb_title_akas.info())
imdb_title_akas.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 331703 entries, 0 to 331702
Data columns (total 8 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   title_id           331703 non-null  object
 1   ordering           331703 non-null  int64
 2   title              331703 non-null  object
 3   region             278410 non-null  object
 4   language           41715 non-null   object
 5   types              168447 non-null  object
 6   attributes         14925 non-null   object
 7   is_original_title  331678 non-null  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 20.2+ MB

None

title_id                  0
ordering                  0
title                     0
region                53293
language             289988
types                163256
attributes           316778
is_original_title        25
dtype: int64

#### imdb.title.basics.csv.gz ####

In [138]:
imdb_title_basics = data_tables['imdb.title.basics.csv.gz']
imdb_title_basics

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
...,...,...,...,...,...,...
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,tt9916622,Rodolpho TeÃ³philo - O Legado de um Pioneiro,Rodolpho TeÃ³philo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,NaN
146143,tt9916754,Chico Albuquerque - RevelaÃ§Ãµes,Chico Albuquerque - RevelaÃ§Ãµes,2013,NaN,Documentary

In [139]:
display(imdb_title_basics.info())
imdb_title_basics.isna().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   tconst           146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

None

tconst                 0
primary_title          0
original_title        21
start_year             0
runtime_minutes    31739
genres              5408
dtype: int64

#### imdb.title.crew.csv.gz ####

In [140]:
data_tables['imdb.title.crew.csv.gz']

           tconst                      directors              writers
0       tt0285252                      nm0899854            nm0899854
1       tt0438973                            NaN  nm0175726,nm1802864
2       tt0462036                      nm1940585            nm1940585
3       tt0835418                      nm0151540  nm0310087,nm0841532
4       tt0878654  nm0089502,nm2291498,nm2292011            nm0284943
...           ...                            ...                  ...
146139  tt8999974                     nm10122357           nm10122357
146140  tt9001390                      nm6711477            nm6711477
146141  tt9001494          nm10123242,nm10123248                  NaN
146142  tt9004986                      nm4993825            nm4993825
146143  tt9010172                            NaN            nm8352242

[146144 rows x 3 columns]

#### imdb.title.principals.csv.gz ####

In [141]:
data_tables['imdb.title.principals.csv.gz']

,tconst,ordering,nconst,category,job,characters
0,tt0111414,1,nm0246005,actor,NaN,"[""The Man""]"
1,tt0111414,2,nm0398271,director,NaN,NaN
2,tt0111414,3,nm3739909,producer,producer,NaN
3,tt0323808,10,nm0059247,editor,NaN,NaN
4,tt0323808,1,nm3579312,actress,NaN,"[""Beth Boothby""]"
...,...,...,...,...,...,...
1028181,tt9692684,1,nm0186469,actor,NaN,"[""Ebenezer Scrooge""]"
1028182,tt9692684,2,nm4929530,self,NaN,"[""Herself"",""Regan""]"
1028183,tt9692684,3,nm10441594,director,NaN,NaN
1028184,tt9692684,4,nm6009913,writer,writer,NaN
1028185,tt9692684,5,nm10441595,producer,producer,NaN

#### imdb.title.ratings.csv.gz ####

In [144]:
imdb_title_ratings = data_tables['imdb.title.ratings.csv.gz']
imdb_title_ratings

           tconst  averagerating  numvotes
0      tt10356526            8.3        31
1      tt10384606            8.9       559
2       tt1042974            6.4        20
3       tt1043726            4.2     50352
4       tt1060240            6.5        21
...           ...            ...       ...
73851   tt9805820            8.1        25
73852   tt9844256            7.5        24
73853   tt9851050            4.7        14
73854   tt9886934            7.0         5
73855   tt9894098            6.3       128

[73856 rows x 3 columns]

In [ ]:
display(imdb_title_ratings.info())

#### rt.movie_info.tsv.gz ####

In [ ]:
data_tables['bom.movie_gross.csv.gz']

#### rt.reviews.tsv.gz ####

In [ ]:
data_tables['bom.movie_gross.csv.gz']

#### tmdb.movies.csv.gz ####

In [ ]:
data_tables['bom.movie_gross.csv.gz']

#### tn.movie_budgets.csv.gz ####

In [ ]:
data_tables['bom.movie_gross.csv.gz']